In [4]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan,'avocado'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [10]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [14]:
cleaned = data.dropna()

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4] = NA

In [19]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
df = pd.DataFrame(np.random.randn(7, 3))

In [22]:
df.iloc[:4, 1] = NA

In [23]:
df

          0         1         2
0 -1.308752       NaN  0.146403
1  0.133263       NaN -0.090061
2  1.329002       NaN  1.675382
3 -0.180218       NaN  2.108128
4  1.189416 -0.535044  0.635476
5 -0.448300  0.375063  0.407248
6 -0.511134  1.052788 -2.544942

In [24]:
df.iloc[:2, 2] = NA

In [25]:
df

          0         1         2
0 -1.308752       NaN       NaN
1  0.133263       NaN       NaN
2  1.329002       NaN  1.675382
3 -0.180218       NaN  2.108128
4  1.189416 -0.535044  0.635476
5 -0.448300  0.375063  0.407248
6 -0.511134  1.052788 -2.544942

In [26]:
df.dropna()

          0         1         2
4  1.189416 -0.535044  0.635476
5 -0.448300  0.375063  0.407248
6 -0.511134  1.052788 -2.544942

In [27]:
df.dropna(thresh=2)

          0         1         2
2  1.329002       NaN  1.675382
3 -0.180218       NaN  2.108128
4  1.189416 -0.535044  0.635476
5 -0.448300  0.375063  0.407248
6 -0.511134  1.052788 -2.544942

In [28]:
df

          0         1         2
0 -1.308752       NaN       NaN
1  0.133263       NaN       NaN
2  1.329002       NaN  1.675382
3 -0.180218       NaN  2.108128
4  1.189416 -0.535044  0.635476
5 -0.448300  0.375063  0.407248
6 -0.511134  1.052788 -2.544942

In [29]:
df.fillna(0)

          0         1         2
0 -1.308752  0.000000  0.000000
1  0.133263  0.000000  0.000000
2  1.329002  0.000000  1.675382
3 -0.180218  0.000000  2.108128
4  1.189416 -0.535044  0.635476
5 -0.448300  0.375063  0.407248
6 -0.511134  1.052788 -2.544942

In [30]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.308752  0.500000  0.000000
1  0.133263  0.500000  0.000000
2  1.329002  0.500000  1.675382
3 -0.180218  0.500000  2.108128
4  1.189416 -0.535044  0.635476
5 -0.448300  0.375063  0.407248
6 -0.511134  1.052788 -2.544942

In [31]:
df.fillna(0, inplace=True)

In [32]:
df

          0         1         2
0 -1.308752  0.000000  0.000000
1  0.133263  0.000000  0.000000
2  1.329002  0.000000  1.675382
3 -0.180218  0.000000  2.108128
4  1.189416 -0.535044  0.635476
5 -0.448300  0.375063  0.407248
6 -0.511134  1.052788 -2.544942

In [33]:
df.iloc[2:, 1] = NA

In [34]:
df.iloc[4:, 2] = NA

In [35]:
df

          0    1         2
0 -1.308752  0.0  0.000000
1  0.133263  0.0  0.000000
2  1.329002  NaN  1.675382
3 -0.180218  NaN  2.108128
4  1.189416  NaN       NaN
5 -0.448300  NaN       NaN
6 -0.511134  NaN       NaN

In [36]:
df.fillna(method='ffill', limit=2)

          0    1         2
0 -1.308752  0.0  0.000000
1  0.133263  0.0  0.000000
2  1.329002  0.0  1.675382
3 -0.180218  0.0  2.108128
4  1.189416  NaN  2.108128
5 -0.448300  NaN  2.108128
6 -0.511134  NaN       NaN

In [37]:
df.fillna(method='ffill')

          0    1         2
0 -1.308752  0.0  0.000000
1  0.133263  0.0  0.000000
2  1.329002  0.0  1.675382
3 -0.180218  0.0  2.108128
4  1.189416  0.0  2.108128
5 -0.448300  0.0  2.108128
6 -0.511134  0.0  2.108128

In [38]:
 data = pd.Series([1., NA, 3.5, NA, 7])

In [39]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [40]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [41]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
            'k2': [1, 1, 2, 3, 3, 4, 4]})

In [42]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [43]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [44]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [45]:
data['v1'] = range(7)

In [46]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [47]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [48]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [49]:
// 
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [56]:
data = pd.DataFrame({
    'food': ['bacon', 'pulled pork','bacon',
             'Pastrami', 'corned beef','Bacon',
             'pastrami','honey ham', 'nova lox'],
            'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]
                    })

In [57]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [58]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [59]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [60]:
lowercased = data['food'].str.lower()

In [61]:
data['animal'] = lowercased.map(meat_to_animal)

In [62]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [63]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [64]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [66]:
data.drop('animal',axis=1)

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [67]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [68]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [69]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
              index=['Ohio', 'Colorado', 'New York'],
                        columns=['one', 'two', 'three', 'four'])

In [70]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [71]:
transform = lambda x: x[:4].upper()

In [72]:
transform

In [73]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [74]:
transform

In [75]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [76]:
data.index = data.index.map(transform)

In [77]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [78]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [79]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [80]:
bins = [18, 25, 35, 60, 100]

In [81]:
cats = pd.cut(ages, bins)

In [82]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [83]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [84]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [85]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [86]:
data = np.random.randn(1000)

In [87]:
cats = pd.qcut(data, 4)

In [88]:
cats

[(0.606, 3.211], (0.606, 3.211], (0.606, 3.211], (0.606, 3.211], (0.606, 3.211], ..., (-0.0376, 0.606], (0.606, 3.211], (-0.0376, 0.606], (-3.381, -0.711], (0.606, 3.211]]
Length: 1000
Categories (4, interval[float64]): [(-3.381, -0.711] < (-0.711, -0.0376] < (-0.0376, 0.606] < (0.606, 3.211]]

In [89]:
pd.value_counts(cats)

(0.606, 3.211]       250
(-0.0376, 0.606]     250
(-0.711, -0.0376]    250
(-3.381, -0.711]     250
dtype: int64

In [90]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0376, 1.215], (-0.0376, 1.215], (-0.0376, 1.215], (-0.0376, 1.215], (-0.0376, 1.215], ..., (-0.0376, 1.215], (-0.0376, 1.215], (-0.0376, 1.215], (-1.221, -0.0376], (-0.0376, 1.215]]
Length: 1000
Categories (4, interval[float64]): [(-3.381, -1.221] < (-1.221, -0.0376] < (-0.0376, 1.215] < (1.215, 3.211]]

In [91]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [92]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.022166    -0.019068    -0.009487    -0.011553
std       0.980506     0.981028     0.996367     1.006214
min      -4.018434    -2.735291    -2.939178    -2.936297
25%      -0.658272    -0.662793    -0.671663    -0.682658
50%      -0.003366    -0.023080    -0.036899    -0.014519
75%       0.574497     0.615681     0.677191     0.652591
max       3.006738     2.983713     3.005297     3.589844

In [93]:
col = data[2]
col

0      0.449080
1     -1.288288
2      0.569596
3      0.311648
4      0.368650
5      0.012142
6      1.139488
7      0.920959
8     -0.673372
9     -0.482447
10    -1.947579
11     0.441179
12     1.013920
13    -1.240832
14     0.803647
15     0.135233
16    -1.723021
17    -0.066603
18    -0.406533
19    -0.164851
20    -0.317070
21    -0.006747
22     0.171340
23    -0.975513
24     0.082126
25     0.003778
26     0.237308
27     1.117679
28    -0.519870
29     0.030099
         ...
970   -0.659029
971   -0.847279
972    0.020723
973    0.241354
974   -0.147456
975   -1.956323
976   -0.111714
977   -1.409098
978    0.277484
979    1.113531
980    1.230818
981    0.044637
982   -0.892644
983   -0.858687
984   -1.395396
985   -1.452090
986   -1.090108
987   -0.283005
988   -0.952169
989    0.023661
990    0.230999
991   -0.134139
992    1.764367
993   -0.924648
994   -0.146877
995    0.539411
996    0.119426
997    0.953629
998    0.240191
999   -0.114200
Name: 2, Length: 1000, dtype: float64

In [94]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
58   3.006738 -0.449374  0.518504  1.141436
109  3.002981  1.253501 -0.789965  1.569547
229 -3.002884  0.378558  0.203578  1.497944
373 -3.057585 -0.241042 -0.016577  0.251559
493 -0.680173  0.175672  0.117052  3.589844
651  2.061695  0.607589  3.005297 -2.040557
702  1.059678 -0.891936  0.149601  3.031172
817 -4.018434  0.626375  0.241851  0.116872

In [95]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [96]:
sampler = np.random.permutation(5)

In [97]:
sampler

array([3, 4, 1, 0, 2])

In [98]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [99]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11

In [100]:
choices = pd.Series([5, 7, -1, 6, 4])

In [101]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [102]:
draws = choices.sample(n=10, replace=True)

In [103]:
draws

0    5
2   -1
2   -1
2   -1
1    7
2   -1
2   -1
1    7
4    4
3    6
dtype: int64

In [104]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
               'data1': range(6)})

In [105]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [106]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [107]:
val = 'a,b,  guido'

In [108]:
val.split(',')

['a', 'b', '  guido']

In [109]:
 pieces = [x.strip() for x in val.split(',')]

In [110]:
pieces

['a', 'b', 'guido']

In [111]:
'::'.join(pieces)

'a::b::guido'

In [112]:
'guido' in val

True

In [113]:
data = {'Dave': 'dave@google.com', 'Steve':
'steve@gmail.com',
     'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [114]:
data = pd.Series(data)

In [115]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [116]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [117]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [118]:
pattern

NameError: name 'pattern' is not defined